TGV/0/U
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector>
1089
(
(0.094626 -0.094626 0)
(0.28046 -0.091206 0)
(0.45615 -0.084489 0)
(0.61536 -0.074719 0)
(0.75233 -0.062248 0)
(0.8621 -0.047528 0)
(0.94072 -0.03109 0)
(0.98534 -0.013528 0)
...
)
;

boundaryField
{
    upperBoundary
    {
        type             cyclic;
        value            nonuniform List<vector>
33
(
(0.094626 -0.094626 0)
(0.28046 -0.091206 0)
(0.45615 -0.084489 0)
(0.61536 -0.074719 0)
(0.75233 -0.062248 0)
(0.8621 -0.047528 0)
(0.94072 -0.03109 0)
(0.98534 -0.013528 0)
...
)
;
    }
    lowerBoundary
    {
        type             cyclic;
        value            nonuniform List<vector>
33
(
(0.094626 0.094626 0)
(0.28046 0.091206 0)
(0.45615 0.084489 0)
(0.61536 0.074719 0)
(0.75233 0.062248 0)
(0.8621 0.047528 0)
(0.94072 0.03109 0)
(0.98534 0.013528 0)
...
)
;
    }
    leftBoundary
    {
        type             cyclic;
        value            nonuniform List<vector>
33
(
(-0.094626 -0.094626 0)
(-0.091206 -0.28046 0)
(-0.084489 -0.45615 0)
(-0.074719 -0.61536 0)
(-0.062248 -0.75233 0)
(-0.047528 -0.8621 0)
(-0.03109 -0.94072 0)
(-0.013528 -0.98534 0)
...
)
;
    }
    rightBoundary
    {
        type             cyclic;
        value            nonuniform List<vector>
33
(
(0.094626 -0.094626 0)
(0.091206 -0.28046 0)
(0.084489 -0.45615 0)
(0.074719 -0.61536 0)
(0.062248 -0.75233 0)
(0.047528 -0.8621 0)
(0.03109 -0.94072 0)
(0.013528 -0.98534 0)
...
)
;
    }
    frontAndBack
    {
        type             empty;
        value            nonuniform List<vector>
2178
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
}

// ************************************************************************* //
