TGV/0/p
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar>
1089
(
0.49096
0.4558
0.3905
0.30442
0.2099
0.12048
0.048969
0.0056089
...
)
;

boundaryField
{
    upperBoundary
    {
        type             cyclic;
        value            nonuniform List<scalar>
33
(
0.49096
0.4558
0.3905
0.30442
0.2099
0.12048
0.048969
0.0056089
...
)
;
    }
    lowerBoundary
    {
        type             cyclic;
        value            nonuniform List<scalar>
33
(
0.49096
0.4558
0.3905
0.30442
0.2099
0.12048
0.048969
0.0056089
...
)
;
    }
    leftBoundary
    {
        type             cyclic;
        value            nonuniform List<scalar>
33
(
0.49096
0.4558
0.3905
0.30442
0.2099
0.12048
0.048969
0.0056089
...
)
;
    }
    rightBoundary
    {
        type             cyclic;
        value            nonuniform List<scalar>
33
(
0.49096
0.4558
0.3905
0.30442
0.2099
0.12048
0.048969
0.0056089
...
)
;
    }
    frontAndBack
    {
        type             empty;
        value            nonuniform List<scalar>
2178
(
0
0
0
0
0
0
0
0
...
)
;
    }
}

// ************************************************************************* //
