TGV/0/Uf
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<scalar>
2112
(
0.18839
-0.18839
0.36998
-0.18159
0.53819
-0.16821
0.68695
-0.14876
...
)
;

boundaryField
{
    upperBoundary
    {
        type             calculated;
        value            nonuniform List<scalar>
33
(
1.7877e-10
1.7231e-10
1.5962e-10
1.4116e-10
1.176e-10
8.9793e-11
5.8737e-11
2.5558e-11
...
)
;
    }
    lowerBoundary
    {
        type             calculated;
        value            nonuniform List<scalar>
33
(
0
0
0
0
0
0
0
0
...
)
;
    }
    leftBoundary
    {
        type             calculated;
        value            nonuniform List<scalar>
33
(
0
0
0
0
0
0
0
0
...
)
;
    }
    rightBoundary
    {
        type             calculated;
        value            nonuniform List<scalar>
33
(
-1.7877e-10
-1.7231e-10
-1.5962e-10
-1.4116e-10
-1.176e-10
-8.9794e-11
-5.8737e-11
-2.5558e-11
...
)
;
    }
    frontAndBack
    {
        type             calculated;
        value            nonuniform List<scalar>
2178
(
0
0
0
0
0
0
0
0
...
)
;
    }
}

// ************************************************************************* //
